cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "r-lib/rig"
tap "laishulu/homebrew"

# CLI Apps ---------------------------------------

brew "bat"
brew "coreutils"
brew "csvlens"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "icu4c"
brew "itchyny/tap/mmv"
brew "macism"
brew "mas"
brew "neovim"
brew "numbat"
brew "pandoc"
brew "python"
brew "ranger"
brew "ripgrep"
brew "ruby"
brew "sd"
brew "sheldon"
brew "shellcheck"
brew "tig"
brew "trash"
brew "vim"
brew "vivid"
brew "yq"
brew "zk"

# GUI Apps ---------------------------------------

cask "appcleaner"
cask "arc"
cask "bettertouchtool"
cask "bike"
cask "chatgpt"
cask "cleanshot"
cask "coteditor"
cask "cursorsense"
cask "discord"
cask "ghostty"
cask "google-drive"
cask "iina"
cask "keka"
cask "kitty"
cask "linear-linear"
cask "mtgto/macskk/macskk"
cask "notion"
cask "notion-calendar"
cask "numi"
cask "raycast"
cask "rectangle"
cask "rstudio"
cask "scroll-reverser"
cask "slack"
cask "superhuman"
cask "superwhisper"
cask "workflowy"
cask "zed"

# Password input required
cask "box-drive"
cask "google-chrome"
cask "karabiner-elements"
cask "logi-options+"
cask "rig"
cask "zoom"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"

# Fonts -------------------------------------------

cask "font-fira-code"
cask "font-hack"
cask "font-jetbrains-mono"
cask "font-lato"
cask "font-noto-sans-jp"
cask "font-noto-serif-jp"
cask "font-source-code-pro"

# App Store --------------------------------------

mas "AdGuard for Safari",    id: 1440147259
mas "Amphetamine",           id: 937984704
mas "Bitwarden",             id: 1352778147
mas "LINE",                  id: 539883307
mas "Yoink",                 id: 457622435
