cask_args appdir: '/Applications'
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"

brew "bat"
brew "cmigemo"
brew "docker"
brew "exa"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "graphviz"
brew "itchyny/tap/mmv"
brew "jupyterlab"
brew "mackup"
brew "macvim"
brew "mas"
brew "node"
brew "pandoc"
brew "python"
brew "qmk"
brew "r"
brew "ripgrep"
brew "ruby"
brew "sd"
brew "tig"
brew "trash"
brew "z"

cask "1password"
cask "alfred"
cask "appcleaner"
cask "aquaskk"
cask "bettertouchtool"
cask "bitwarden"
cask "box-drive"
cask "chatwork"
cask "coteditor"
cask "dash"
cask "discord"
cask "docker"
cask "gitup"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "kindle"
cask "logitech-options"
cask "microsoft-office"
cask "obs"
cask "qmk-toolbox"
cask "rectangle"
cask "rstudio"
cask "scroll-reverser"
cask "slack"
cask "superhuman"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"

cask "font-cantarell"
cask "font-dejavu-sans"
cask "font-hack"
cask "font-inconsolata"
cask "font-lato"
cask "font-noto-sans-cjk-jp"
cask "font-noto-serif-cjk-jp"
cask "font-source-code-pro"
cask "font-source-han-code-jp"

mas "Amphetamine", id: 937984704
mas "Gravit Designer", id: 1207744923
mas "LINE", id: 539883307
mas "Textwell", id: 905944937
mas "Trello", id: 1278508951
mas "Yoink", id: 457622435
